# XYZ Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
XYZ Methods
XYZ Class See Also
---
The XYZ type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Add | Adds the specified vector to this vector and returns the result. |
| AngleOnPlaneTo | Returns the angle between this vector and the specified vector projected to the specified plane. |
| AngleTo | Returns the angle between this vector and the specified vector. |
| CrossProduct | The cross product of this vector and the specified vector. |
| DistanceTo | Returns the distance from this point to the specified point. |
| Divide | Divides this vector by the specified value and returns the result. |
| DotProduct | The dot product of this vector and the specified vector. |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLength | Gets the length of this vector. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsAlmostEqualTo(XYZ) | Determines whether this vector and the specified vector are the same within the tolerance (1.0e-09). |
| IsAlmostEqualTo(XYZ, Double) | Determines whether 2 vectors are the same within the given tolerance. |
| IsUnitLength | The boolean value that indicates whether this vector is of unit length. |
| IsWithinLengthLimits | Validates that the input point is within Revit design limits. |
| IsZeroLength | The boolean value that indicates whether this vector is a zero vector. |
| Multiply | Multiplies this vector by the specified value and returns the result. |
| Negate | Negates this vector. |
| Normalize | Returns a new XYZ whose coordinates are the normalized values from this vector. |
| Subtract | Subtracts the specified vector from this vector and returns the result. |
| ToString | Gets formatted string showing (X, Y, Z) with values formatted to 9 decimal places.  (Overrides Object..::..ToString()()()().) |
| TripleProduct | The triple product of this vector and the two specified vectors. |

# See Also
XYZ Class
Autodesk.Revit.DB Namespace